Revit 2024 API
ImageInstance.HeightScale Property
 The factor applied to the ImageType to calculate the Height of the ImageInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public double HeightScale { get; set; }
Visual Basic
Public Property HeightScale As Double
	Get
	Set
Visual C++
public:
property double HeightScale {
	double get ();
	void set (double value);
}
Remarks
 If LockProportions is true, then changes to the HeightScale will also result in changes to the WidthScale.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for heightScale results in a height that is more than 30000 feet. -or- When setting this property: The given value for heightScale results in a width that is more than 30000 feet because LockProportions is set to true.
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for heightScale must be non-negative.
See Also
ImageInstance Class
Autodesk.Revit.DB Namespace